GopalSaraf/Practicals/PSDL/include/proc/pic18f06q40.inc
// Register: RA5PPS
#define RA5PPS RA5PPS
RA5PPS                                   equ 0206h
// bitfield definitions
RA5PPS_RA5PPS0_POSN                      equ 0000h
RA5PPS_RA5PPS0_POSITION                  equ 0000h
RA5PPS_RA5PPS0_SIZE                      equ 0001h
RA5PPS_RA5PPS0_LENGTH                    equ 0001h
RA5PPS_RA5PPS0_MASK                      equ 0001h
RA5PPS_RA5PPS1_POSN                      equ 0001h
RA5PPS_RA5PPS1_POSITION                  equ 0001h
RA5PPS_RA5PPS1_SIZE                      equ 0001h
RA5PPS_RA5PPS1_LENGTH                    equ 0001h
RA5PPS_RA5PPS1_MASK                      equ 0002h
RA5PPS_RA5PPS2_POSN                      equ 0002h
RA5PPS_RA5PPS2_POSITION                  equ 0002h
RA5PPS_RA5PPS2_SIZE                      equ 0001h
RA5PPS_RA5PPS2_LENGTH                    equ 0001h
RA5PPS_RA5PPS2_MASK                      equ 0004h
RA5PPS_RA5PPS3_POSN                      equ 0003h
RA5PPS_RA5PPS3_POSITION                  equ 0003h
RA5PPS_RA5PPS3_SIZE                      equ 0001h
RA5PPS_RA5PPS3_LENGTH                    equ 0001h
RA5PPS_RA5PPS3_MASK                      equ 0008h
RA5PPS_RA5PPS4_POSN                      equ 0004h
RA5PPS_RA5PPS4_POSITION                  equ 0004h
RA5PPS_RA5PPS4_SIZE                      equ 0001h
RA5PPS_RA5PPS4_LENGTH                    equ 0001h
RA5PPS_RA5PPS4_MASK                      equ 0010h
RA5PPS_RA5PPS5_POSN                      equ 0005h
RA5PPS_RA5PPS5_POSITION                  equ 0005h
RA5PPS_RA5PPS5_SIZE                      equ 0001h
RA5PPS_RA5PPS5_LENGTH                    equ 0001h
RA5PPS_RA5PPS5_MASK                      equ 0020h

// Register: RC0PPS
#define RC0PPS RC0PPS
RC0PPS                                   equ 0211h
// bitfield definitions
RC0PPS_RC0PPS0_POSN                      equ 0000h
RC0PPS_RC0PPS0_POSITION                  equ 0000h
RC0PPS_RC0PPS0_SIZE                      equ 0001h
RC0PPS_RC0PPS0_LENGTH                    equ 0001h
RC0PPS_RC0PPS0_MASK                      equ 0001h
RC0PPS_RC0PPS1_POSN                      equ 0001h
RC0PPS_RC0PPS1_POSITION                  equ 0001h
RC0PPS_RC0PPS1_SIZE                      equ 0001h
RC0PPS_RC0PPS1_LENGTH                    equ 0001h
RC0PPS_RC0PPS1_MASK                      equ 0002h
RC0PPS_RC0PPS2_POSN                      equ 0002h
RC0PPS_RC0PPS2_POSITION                  equ 0002h
RC0PPS_RC0PPS2_SIZE                      equ 0001h
RC0PPS_RC0PPS2_LENGTH                    equ 0001h
RC0PPS_RC0PPS2_MASK                      equ 0004h
RC0PPS_RC0PPS3_POSN                      equ 0003h
RC0PPS_RC0PPS3_POSITION                  equ 0003h
RC0PPS_RC0PPS3_SIZE                      equ 0001h
RC0PPS_RC0PPS3_LENGTH                    equ 0001h
RC0PPS_RC0PPS3_MASK                      equ 0008h
RC0PPS_RC0PPS4_POSN                      equ 0004h
RC0PPS_RC0PPS4_POSITION                  equ 0004h
RC0PPS_RC0PPS4_SIZE                      equ 0001h
RC0PPS_RC0PPS4_LENGTH                    equ 0001h
RC0PPS_RC0PPS4_MASK                      equ 0010h
RC0PPS_RC0PPS5_POSN                      equ 0005h
RC0PPS_RC0PPS5_POSITION                  equ 0005h
RC0PPS_RC0PPS5_SIZE                      equ 0001h
RC0PPS_RC0PPS5_LENGTH                    equ 0001h
RC0PPS_RC0PPS5_MASK                      equ 0020h

// Register: RC1PPS
#define RC1PPS RC1PPS
RC1PPS                                   equ 0212h
// bitfield definitions
RC1PPS_RC1PPS0_POSN                      equ 0000h
RC1PPS_RC1PPS0_POSITION                  equ 0000h
RC1PPS_RC1PPS0_SIZE                      equ 0001h
RC1PPS_RC1PPS0_LENGTH                    equ 0001h
RC1PPS_RC1PPS0_MASK                      equ 0001h
RC1PPS_RC1PPS1_POSN                      equ 0001h
RC1PPS_RC1PPS1_POSITION                  equ 0001h
RC1PPS_RC1PPS1_SIZE                      equ 0001h
RC1PPS_RC1PPS1_LENGTH                    equ 0001h
RC1PPS_RC1PPS1_MASK                      equ 0002h
RC1PPS_RC1PPS2_POSN                      equ 0002h
RC1PPS_RC1PPS2_POSITION                  equ 0002h
RC1PPS_RC1PPS2_SIZE                      equ 0001h
RC1PPS_RC1PPS2_LENGTH                    equ 0001h
RC1PPS_RC1PPS2_MASK                      equ 0004h
RC1PPS_RC1PPS3_POSN                      equ 0003h
RC1PPS_RC1PPS3_POSITION                  equ 0003h
RC1PPS_RC1PPS3_SIZE                      equ 0001h
RC1PPS_RC1PPS3_LENGTH                    equ 0001h
RC1PPS_RC1PPS3_MASK                      equ 0008h
RC1PPS_RC1PPS4_POSN                      equ 0004h
RC1PPS_RC1PPS4_POSITION                  equ 0004h
RC1PPS_RC1PPS4_SIZE                      equ 0001h
RC1PPS_RC1PPS4_LENGTH                    equ 0001h
RC1PPS_RC1PPS4_MASK                      equ 0010h
RC1PPS_RC1PPS5_POSN                      equ 0005h
RC1PPS_RC1PPS5_POSITION                  equ 0005h
RC1PPS_RC1PPS5_SIZE                      equ 0001h
RC1PPS_RC1PPS5_LENGTH                    equ 0001h
RC1PPS_RC1PPS5_MASK                      equ 0020h

// Register: RC2PPS
#define RC2PPS RC2PPS
RC2PPS                                   equ 0213h
// bitfield definitions
RC2PPS_RC2PPS0_POSN                      equ 0000h
RC2PPS_RC2PPS0_POSITION                  equ 0000h
RC2PPS_RC2PPS0_SIZE                      equ 0001h
RC2PPS_RC2PPS0_LENGTH                    equ 0001h
RC2PPS_RC2PPS0_MASK                      equ 0001h
RC2PPS_RC2PPS1_POSN                      equ 0001h
RC2PPS_RC2PPS1_POSITION                  equ 0001h
RC2PPS_RC2PPS1_SIZE                      equ 0001h
RC2PPS_RC2PPS1_LENGTH                    equ 0001h
RC2PPS_RC2PPS1_MASK                      equ 0002h
RC2PPS_RC2PPS2_POSN                      equ 0002h
RC2PPS_RC2PPS2_POSITION                  equ 0002h
RC2PPS_RC2PPS2_SIZE                      equ 0001h
RC2PPS_RC2PPS2_LENGTH                    equ 0001h
RC2PPS_RC2PPS2_MASK                      equ 0004h
RC2PPS_RC2PPS3_POSN                      equ 0003h
RC2PPS_RC2PPS3_POSITION                  equ 0003h
RC2PPS_RC2PPS3_SIZE                      equ 0001h
RC2PPS_RC2PPS3_LENGTH                    equ 0001h
RC2PPS_RC2PPS3_MASK                      equ 0008h
RC2PPS_RC2PPS4_POSN                      equ 0004h
RC2PPS_RC2PPS4_POSITION                  equ 0004h
RC2PPS_RC2PPS4_SIZE                      equ 0001h
RC2PPS_RC2PPS4_LENGTH                    equ 0001h
RC2PPS_RC2PPS4_MASK                      equ 0010h
RC2PPS_RC2PPS5_POSN                      equ 0005h
RC2PPS_RC2PPS5_POSITION                  equ 0005h
RC2PPS_RC2PPS5_SIZE                      equ 0001h
RC2PPS_RC2PPS5_LENGTH                    equ 0001h
RC2PPS_RC2PPS5_MASK                      equ 0020h

