GopalSaraf/Practicals/PSDL/include/proc/pic18f06q40.inc
// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
PWMIN0PPS                                equ 0257h
// bitfield definitions
PWMIN0PPS_PIN_POSN                       equ 0000h
PWMIN0PPS_PIN_POSITION                   equ 0000h
PWMIN0PPS_PIN_SIZE                       equ 0003h
PWMIN0PPS_PIN_LENGTH                     equ 0003h
PWMIN0PPS_PIN_MASK                       equ 0007h
PWMIN0PPS_PORT_POSN                      equ 0003h
PWMIN0PPS_PORT_POSITION                  equ 0003h
PWMIN0PPS_PORT_SIZE                      equ 0003h
PWMIN0PPS_PORT_LENGTH                    equ 0003h
PWMIN0PPS_PORT_MASK                      equ 0038h
PWMIN0PPS_PWMIN0PPS_POSN                 equ 0000h
PWMIN0PPS_PWMIN0PPS_POSITION             equ 0000h
PWMIN0PPS_PWMIN0PPS_SIZE                 equ 0006h
PWMIN0PPS_PWMIN0PPS_LENGTH               equ 0006h
PWMIN0PPS_PWMIN0PPS_MASK                 equ 003Fh
PWMIN0PPS_PWMIN0PPS0_POSN                equ 0000h
PWMIN0PPS_PWMIN0PPS0_POSITION            equ 0000h
PWMIN0PPS_PWMIN0PPS0_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS0_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS0_MASK                equ 0001h
PWMIN0PPS_PWMIN0PPS1_POSN                equ 0001h
PWMIN0PPS_PWMIN0PPS1_POSITION            equ 0001h
PWMIN0PPS_PWMIN0PPS1_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS1_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS1_MASK                equ 0002h
PWMIN0PPS_PWMIN0PPS2_POSN                equ 0002h
PWMIN0PPS_PWMIN0PPS2_POSITION            equ 0002h
PWMIN0PPS_PWMIN0PPS2_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS2_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS2_MASK                equ 0004h
PWMIN0PPS_PWMIN0PPS3_POSN                equ 0003h
PWMIN0PPS_PWMIN0PPS3_POSITION            equ 0003h
PWMIN0PPS_PWMIN0PPS3_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS3_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS3_MASK                equ 0008h
PWMIN0PPS_PWMIN0PPS4_POSN                equ 0004h
PWMIN0PPS_PWMIN0PPS4_POSITION            equ 0004h
PWMIN0PPS_PWMIN0PPS4_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS4_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS4_MASK                equ 0010h
PWMIN0PPS_PWMIN0PPS5_POSN                equ 0005h
PWMIN0PPS_PWMIN0PPS5_POSITION            equ 0005h
PWMIN0PPS_PWMIN0PPS5_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS5_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS5_MASK                equ 0020h

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
PWMIN1PPS                                equ 0258h
// bitfield definitions
PWMIN1PPS_PIN_POSN                       equ 0000h
PWMIN1PPS_PIN_POSITION                   equ 0000h
PWMIN1PPS_PIN_SIZE                       equ 0003h
PWMIN1PPS_PIN_LENGTH                     equ 0003h
PWMIN1PPS_PIN_MASK                       equ 0007h
PWMIN1PPS_PORT_POSN                      equ 0003h
PWMIN1PPS_PORT_POSITION                  equ 0003h
PWMIN1PPS_PORT_SIZE                      equ 0003h
PWMIN1PPS_PORT_LENGTH                    equ 0003h
PWMIN1PPS_PORT_MASK                      equ 0038h
PWMIN1PPS_PWMIN1PPS_POSN                 equ 0000h
PWMIN1PPS_PWMIN1PPS_POSITION             equ 0000h
PWMIN1PPS_PWMIN1PPS_SIZE                 equ 0006h
PWMIN1PPS_PWMIN1PPS_LENGTH               equ 0006h
PWMIN1PPS_PWMIN1PPS_MASK                 equ 003Fh
PWMIN1PPS_PWMIN1PPS0_POSN                equ 0000h
PWMIN1PPS_PWMIN1PPS0_POSITION            equ 0000h
PWMIN1PPS_PWMIN1PPS0_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS0_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS0_MASK                equ 0001h
PWMIN1PPS_PWMIN1PPS1_POSN                equ 0001h
PWMIN1PPS_PWMIN1PPS1_POSITION            equ 0001h
PWMIN1PPS_PWMIN1PPS1_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS1_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS1_MASK                equ 0002h
PWMIN1PPS_PWMIN1PPS2_POSN                equ 0002h
PWMIN1PPS_PWMIN1PPS2_POSITION            equ 0002h
PWMIN1PPS_PWMIN1PPS2_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS2_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS2_MASK                equ 0004h
PWMIN1PPS_PWMIN1PPS3_POSN                equ 0003h
PWMIN1PPS_PWMIN1PPS3_POSITION            equ 0003h
PWMIN1PPS_PWMIN1PPS3_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS3_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS3_MASK                equ 0008h
PWMIN1PPS_PWMIN1PPS4_POSN                equ 0004h
PWMIN1PPS_PWMIN1PPS4_POSITION            equ 0004h
PWMIN1PPS_PWMIN1PPS4_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS4_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS4_MASK                equ 0010h
PWMIN1PPS_PWMIN1PPS5_POSN                equ 0005h
PWMIN1PPS_PWMIN1PPS5_POSITION            equ 0005h
PWMIN1PPS_PWMIN1PPS5_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS5_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS5_MASK                equ 0020h

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
SMT1WINPPS                               equ 0259h
// bitfield definitions
SMT1WINPPS_PIN_POSN                      equ 0000h
SMT1WINPPS_PIN_POSITION                  equ 0000h
SMT1WINPPS_PIN_SIZE                      equ 0003h
SMT1WINPPS_PIN_LENGTH                    equ 0003h
SMT1WINPPS_PIN_MASK                      equ 0007h
SMT1WINPPS_PORT_POSN                     equ 0003h
SMT1WINPPS_PORT_POSITION                 equ 0003h
SMT1WINPPS_PORT_SIZE                     equ 0003h
SMT1WINPPS_PORT_LENGTH                   equ 0003h
SMT1WINPPS_PORT_MASK                     equ 0038h
SMT1WINPPS_SMT1WINPPS_POSN               equ 0000h
SMT1WINPPS_SMT1WINPPS_POSITION           equ 0000h
SMT1WINPPS_SMT1WINPPS_SIZE               equ 0006h
SMT1WINPPS_SMT1WINPPS_LENGTH             equ 0006h
SMT1WINPPS_SMT1WINPPS_MASK               equ 003Fh
SMT1WINPPS_SMT1WINPPS0_POSN              equ 0000h
SMT1WINPPS_SMT1WINPPS0_POSITION          equ 0000h
SMT1WINPPS_SMT1WINPPS0_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS0_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS0_MASK              equ 0001h
SMT1WINPPS_SMT1WINPPS1_POSN              equ 0001h
SMT1WINPPS_SMT1WINPPS1_POSITION          equ 0001h
SMT1WINPPS_SMT1WINPPS1_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS1_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS1_MASK              equ 0002h
SMT1WINPPS_SMT1WINPPS2_POSN              equ 0002h
SMT1WINPPS_SMT1WINPPS2_POSITION          equ 0002h
SMT1WINPPS_SMT1WINPPS2_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS2_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS2_MASK              equ 0004h
SMT1WINPPS_SMT1WINPPS3_POSN              equ 0003h
SMT1WINPPS_SMT1WINPPS3_POSITION          equ 0003h
SMT1WINPPS_SMT1WINPPS3_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS3_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS3_MASK              equ 0008h
SMT1WINPPS_SMT1WINPPS4_POSN              equ 0004h
SMT1WINPPS_SMT1WINPPS4_POSITION          equ 0004h
SMT1WINPPS_SMT1WINPPS4_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS4_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS4_MASK              equ 0010h
SMT1WINPPS_SMT1WINPPS5_POSN              equ 0005h
SMT1WINPPS_SMT1WINPPS5_POSITION          equ 0005h
SMT1WINPPS_SMT1WINPPS5_SIZE              equ 0001h
SMT1WINPPS_SMT1WINPPS5_LENGTH            equ 0001h
SMT1WINPPS_SMT1WINPPS5_MASK              equ 0020h

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
SMT1SIGPPS                               equ 025Ah
// bitfield definitions
SMT1SIGPPS_PIN_POSN                      equ 0000h
SMT1SIGPPS_PIN_POSITION                  equ 0000h
SMT1SIGPPS_PIN_SIZE                      equ 0003h
SMT1SIGPPS_PIN_LENGTH                    equ 0003h
SMT1SIGPPS_PIN_MASK                      equ 0007h
SMT1SIGPPS_PORT_POSN                     equ 0003h
SMT1SIGPPS_PORT_POSITION                 equ 0003h
SMT1SIGPPS_PORT_SIZE                     equ 0003h
SMT1SIGPPS_PORT_LENGTH                   equ 0003h
SMT1SIGPPS_PORT_MASK                     equ 0038h
SMT1SIGPPS_SMT1SIGPPS_POSN               equ 0000h
SMT1SIGPPS_SMT1SIGPPS_POSITION           equ 0000h
SMT1SIGPPS_SMT1SIGPPS_SIZE               equ 0006h
SMT1SIGPPS_SMT1SIGPPS_LENGTH             equ 0006h
SMT1SIGPPS_SMT1SIGPPS_MASK               equ 003Fh
SMT1SIGPPS_SMT1SIGPPS0_POSN              equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_POSITION          equ 0000h
SMT1SIGPPS_SMT1SIGPPS0_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS0_MASK              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSN              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_POSITION          equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS1_MASK              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSN              equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_POSITION          equ 0002h
SMT1SIGPPS_SMT1SIGPPS2_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS2_MASK              equ 0004h
SMT1SIGPPS_SMT1SIGPPS3_POSN              equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_POSITION          equ 0003h
SMT1SIGPPS_SMT1SIGPPS3_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS3_MASK              equ 0008h
SMT1SIGPPS_SMT1SIGPPS4_POSN              equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_POSITION          equ 0004h
SMT1SIGPPS_SMT1SIGPPS4_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS4_MASK              equ 0010h
SMT1SIGPPS_SMT1SIGPPS5_POSN              equ 0005h
SMT1SIGPPS_SMT1SIGPPS5_POSITION          equ 0005h
SMT1SIGPPS_SMT1SIGPPS5_SIZE              equ 0001h
SMT1SIGPPS_SMT1SIGPPS5_LENGTH            equ 0001h
SMT1SIGPPS_SMT1SIGPPS5_MASK              equ 0020h

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
CWG1PPS                                  equ 025Bh
// bitfield definitions
CWG1PPS_PIN_POSN                         equ 0000h
CWG1PPS_PIN_POSITION                     equ 0000h
CWG1PPS_PIN_SIZE                         equ 0003h
CWG1PPS_PIN_LENGTH                       equ 0003h
CWG1PPS_PIN_MASK                         equ 0007h
CWG1PPS_PORT_POSN                        equ 0003h
CWG1PPS_PORT_POSITION                    equ 0003h
CWG1PPS_PORT_SIZE                        equ 0003h
CWG1PPS_PORT_LENGTH                      equ 0003h
CWG1PPS_PORT_MASK                        equ 0038h
CWG1PPS_CWGINPPS0_POSN                   equ 0000h
CWG1PPS_CWGINPPS0_POSITION               equ 0000h
CWG1PPS_CWGINPPS0_SIZE                   equ 0001h
CWG1PPS_CWGINPPS0_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS0_MASK                   equ 0001h
CWG1PPS_CWGINPPS1_POSN                   equ 0001h
CWG1PPS_CWGINPPS1_POSITION               equ 0001h
CWG1PPS_CWGINPPS1_SIZE                   equ 0001h
CWG1PPS_CWGINPPS1_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS1_MASK                   equ 0002h
CWG1PPS_CWGINPPS2_POSN                   equ 0002h
CWG1PPS_CWGINPPS2_POSITION               equ 0002h
CWG1PPS_CWGINPPS2_SIZE                   equ 0001h
CWG1PPS_CWGINPPS2_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS2_MASK                   equ 0004h
CWG1PPS_CWGINPPS3_POSN                   equ 0003h
CWG1PPS_CWGINPPS3_POSITION               equ 0003h
CWG1PPS_CWGINPPS3_SIZE                   equ 0001h
CWG1PPS_CWGINPPS3_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS3_MASK                   equ 0008h
CWG1PPS_CWGINPPS4_POSN                   equ 0004h
CWG1PPS_CWGINPPS4_POSITION               equ 0004h
CWG1PPS_CWGINPPS4_SIZE                   equ 0001h
CWG1PPS_CWGINPPS4_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS4_MASK                   equ 0010h
CWG1PPS_CWGINPPS5_POSN                   equ 0005h
CWG1PPS_CWGINPPS5_POSITION               equ 0005h
CWG1PPS_CWGINPPS5_SIZE                   equ 0001h
CWG1PPS_CWGINPPS5_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS5_MASK                   equ 0020h
CWG1PPS_CWG1INPPS_POSN                   equ 0000h
CWG1PPS_CWG1INPPS_POSITION               equ 0000h
CWG1PPS_CWG1INPPS_SIZE                   equ 0006h
CWG1PPS_CWG1INPPS_LENGTH                 equ 0006h
CWG1PPS_CWG1INPPS_MASK                   equ 003Fh
CWG1PPS_CWG1INPPS0_POSN                  equ 0000h
CWG1PPS_CWG1INPPS0_POSITION              equ 0000h
CWG1PPS_CWG1INPPS0_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS0_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS0_MASK                  equ 0001h
CWG1PPS_CWG1INPPS1_POSN                  equ 0001h
CWG1PPS_CWG1INPPS1_POSITION              equ 0001h
CWG1PPS_CWG1INPPS1_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS1_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS1_MASK                  equ 0002h
CWG1PPS_CWG1INPPS2_POSN                  equ 0002h
CWG1PPS_CWG1INPPS2_POSITION              equ 0002h
CWG1PPS_CWG1INPPS2_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS2_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS2_MASK                  equ 0004h
CWG1PPS_CWG1INPPS3_POSN                  equ 0003h
CWG1PPS_CWG1INPPS3_POSITION              equ 0003h
CWG1PPS_CWG1INPPS3_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS3_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS3_MASK                  equ 0008h
CWG1PPS_CWG1INPPS4_POSN                  equ 0004h
CWG1PPS_CWG1INPPS4_POSITION              equ 0004h
CWG1PPS_CWG1INPPS4_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS4_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS4_MASK                  equ 0010h
CWG1PPS_CWG1INPPS5_POSN                  equ 0005h
CWG1PPS_CWG1INPPS5_POSITION              equ 0005h
CWG1PPS_CWG1INPPS5_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS5_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS5_MASK                  equ 0020h
CWG1PPS_CWGINPPS_POSN                    equ 0000h
CWG1PPS_CWGINPPS_POSITION                equ 0000h
CWG1PPS_CWGINPPS_SIZE                    equ 0006h
CWG1PPS_CWGINPPS_LENGTH                  equ 0006h
CWG1PPS_CWGINPPS_MASK                    equ 003Fh

// Register: MD1CARLPPS
#define MD1CARLPPS MD1CARLPPS
MD1CARLPPS                               equ 025Eh
// bitfield definitions
MD1CARLPPS_PIN_POSN                      equ 0000h
MD1CARLPPS_PIN_POSITION                  equ 0000h
MD1CARLPPS_PIN_SIZE                      equ 0003h
MD1CARLPPS_PIN_LENGTH                    equ 0003h
MD1CARLPPS_PIN_MASK                      equ 0007h
MD1CARLPPS_PORT_POSN                     equ 0003h
MD1CARLPPS_PORT_POSITION                 equ 0003h
MD1CARLPPS_PORT_SIZE                     equ 0003h
MD1CARLPPS_PORT_LENGTH                   equ 0003h
MD1CARLPPS_PORT_MASK                     equ 0038h
MD1CARLPPS_MDCARLPPS0_POSN               equ 0000h
MD1CARLPPS_MDCARLPPS0_POSITION           equ 0000h
MD1CARLPPS_MDCARLPPS0_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS0_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS0_MASK               equ 0001h
MD1CARLPPS_MDCARLPPS1_POSN               equ 0001h
MD1CARLPPS_MDCARLPPS1_POSITION           equ 0001h
MD1CARLPPS_MDCARLPPS1_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS1_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS1_MASK               equ 0002h
MD1CARLPPS_MDCARLPPS2_POSN               equ 0002h
MD1CARLPPS_MDCARLPPS2_POSITION           equ 0002h
MD1CARLPPS_MDCARLPPS2_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS2_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS2_MASK               equ 0004h
MD1CARLPPS_MDCARLPPS3_POSN               equ 0003h
MD1CARLPPS_MDCARLPPS3_POSITION           equ 0003h
MD1CARLPPS_MDCARLPPS3_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS3_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS3_MASK               equ 0008h
MD1CARLPPS_MDCARLPPS4_POSN               equ 0004h
MD1CARLPPS_MDCARLPPS4_POSITION           equ 0004h
MD1CARLPPS_MDCARLPPS4_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS4_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS4_MASK               equ 0010h
MD1CARLPPS_MDCARLPPS5_POSN               equ 0005h
MD1CARLPPS_MDCARLPPS5_POSITION           equ 0005h
MD1CARLPPS_MDCARLPPS5_SIZE               equ 0001h
MD1CARLPPS_MDCARLPPS5_LENGTH             equ 0001h
MD1CARLPPS_MDCARLPPS5_MASK               equ 0020h
MD1CARLPPS_MDCARLPPS_POSN                equ 0000h
MD1CARLPPS_MDCARLPPS_POSITION            equ 0000h
MD1CARLPPS_MDCARLPPS_SIZE                equ 0006h
MD1CARLPPS_MDCARLPPS_LENGTH              equ 0006h
MD1CARLPPS_MDCARLPPS_MASK                equ 003Fh

// Register: MD1CARHPPS
#define MD1CARHPPS MD1CARHPPS
MD1CARHPPS                               equ 025Fh
// bitfield definitions
MD1CARHPPS_PIN_POSN                      equ 0000h
MD1CARHPPS_PIN_POSITION                  equ 0000h
MD1CARHPPS_PIN_SIZE                      equ 0003h
MD1CARHPPS_PIN_LENGTH                    equ 0003h
MD1CARHPPS_PIN_MASK                      equ 0007h
MD1CARHPPS_PORT_POSN                     equ 0003h
MD1CARHPPS_PORT_POSITION                 equ 0003h
MD1CARHPPS_PORT_SIZE                     equ 0003h
MD1CARHPPS_PORT_LENGTH                   equ 0003h
MD1CARHPPS_PORT_MASK                     equ 0038h
MD1CARHPPS_MDCARHPPS0_POSN               equ 0000h
MD1CARHPPS_MDCARHPPS0_POSITION           equ 0000h
MD1CARHPPS_MDCARHPPS0_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS0_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS0_MASK               equ 0001h
MD1CARHPPS_MDCARHPPS1_POSN               equ 0001h
MD1CARHPPS_MDCARHPPS1_POSITION           equ 0001h
MD1CARHPPS_MDCARHPPS1_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS1_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS1_MASK               equ 0002h
MD1CARHPPS_MDCARHPPS2_POSN               equ 0002h
MD1CARHPPS_MDCARHPPS2_POSITION           equ 0002h
MD1CARHPPS_MDCARHPPS2_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS2_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS2_MASK               equ 0004h
MD1CARHPPS_MDCARHPPS3_POSN               equ 0003h
MD1CARHPPS_MDCARHPPS3_POSITION           equ 0003h
MD1CARHPPS_MDCARHPPS3_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS3_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS3_MASK               equ 0008h
MD1CARHPPS_MDCARHPPS4_POSN               equ 0004h
MD1CARHPPS_MDCARHPPS4_POSITION           equ 0004h
MD1CARHPPS_MDCARHPPS4_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS4_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS4_MASK               equ 0010h
MD1CARHPPS_MDCARHPPS5_POSN               equ 0005h
MD1CARHPPS_MDCARHPPS5_POSITION           equ 0005h
MD1CARHPPS_MDCARHPPS5_SIZE               equ 0001h
MD1CARHPPS_MDCARHPPS5_LENGTH             equ 0001h
MD1CARHPPS_MDCARHPPS5_MASK               equ 0020h
MD1CARHPPS_MDCARHPPS_POSN                equ 0000h
MD1CARHPPS_MDCARHPPS_POSITION            equ 0000h
MD1CARHPPS_MDCARHPPS_SIZE                equ 0006h
MD1CARHPPS_MDCARHPPS_LENGTH              equ 0006h
MD1CARHPPS_MDCARHPPS_MASK                equ 003Fh

// Register: MD1SRCPPS
#define MD1SRCPPS MD1SRCPPS
MD1SRCPPS                                equ 0260h
// bitfield definitions
MD1SRCPPS_PIN_POSN                       equ 0000h
MD1SRCPPS_PIN_POSITION                   equ 0000h
MD1SRCPPS_PIN_SIZE                       equ 0003h
MD1SRCPPS_PIN_LENGTH                     equ 0003h
MD1SRCPPS_PIN_MASK                       equ 0007h
MD1SRCPPS_PORT_POSN                      equ 0003h
MD1SRCPPS_PORT_POSITION                  equ 0003h
MD1SRCPPS_PORT_SIZE                      equ 0003h
MD1SRCPPS_PORT_LENGTH                    equ 0003h
MD1SRCPPS_PORT_MASK                      equ 0038h
MD1SRCPPS_MDSRCPPS0_POSN                 equ 0000h
MD1SRCPPS_MDSRCPPS0_POSITION             equ 0000h
MD1SRCPPS_MDSRCPPS0_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS0_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS0_MASK                 equ 0001h
MD1SRCPPS_MDSRCPPS1_POSN                 equ 0001h
MD1SRCPPS_MDSRCPPS1_POSITION             equ 0001h
MD1SRCPPS_MDSRCPPS1_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS1_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS1_MASK                 equ 0002h
MD1SRCPPS_MDSRCPPS2_POSN                 equ 0002h
MD1SRCPPS_MDSRCPPS2_POSITION             equ 0002h
MD1SRCPPS_MDSRCPPS2_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS2_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS2_MASK                 equ 0004h
MD1SRCPPS_MDSRCPPS3_POSN                 equ 0003h
MD1SRCPPS_MDSRCPPS3_POSITION             equ 0003h
MD1SRCPPS_MDSRCPPS3_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS3_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS3_MASK                 equ 0008h
MD1SRCPPS_MDSRCPPS4_POSN                 equ 0004h
MD1SRCPPS_MDSRCPPS4_POSITION             equ 0004h
MD1SRCPPS_MDSRCPPS4_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS4_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS4_MASK                 equ 0010h
MD1SRCPPS_MDSRCPPS5_POSN                 equ 0005h
MD1SRCPPS_MDSRCPPS5_POSITION             equ 0005h
MD1SRCPPS_MDSRCPPS5_SIZE                 equ 0001h
MD1SRCPPS_MDSRCPPS5_LENGTH               equ 0001h
MD1SRCPPS_MDSRCPPS5_MASK                 equ 0020h
MD1SRCPPS_MDSRCPPS_POSN                  equ 0000h
MD1SRCPPS_MDSRCPPS_POSITION              equ 0000h
MD1SRCPPS_MDSRCPPS_SIZE                  equ 0006h
MD1SRCPPS_MDSRCPPS_LENGTH                equ 0006h
MD1SRCPPS_MDSRCPPS_MASK                  equ 003Fh

